In [42]:
import pandas as pd

In [43]:
ti = pd.read_csv('titanic.csv')
ti.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
import math
fill_Age = math.floor(ti.Age.mean())
ti.Age = ti.Age.fillna(fill_Age)

In [45]:
inputs = ti.drop('Survived', axis = 'columns')
target = ti['Survived']

In [46]:
input1 = ti.drop(['PassengerId','Survived','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns')
input1

,Pclass,Name,Sex,Age,Fare
0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000
4,3,"Allen, Mr. William Henry",male,35.0,8.0500
...,...,...,...,...,...
886,2,"Montvila, Rev. Juozas",male,27.0,13.0000
887,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000
888,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,23.4500
889,1,"Behr, Mr. Karl Howell",male,26.0,30.0000
890,3,"Dooley, Mr. Patrick",male,32.0,7.7500

In [47]:
from sklearn.preprocessing import LabelEncoder

In [48]:
le_Name = LabelEncoder()
le_Sex = LabelEncoder()

In [49]:
input1['Name_n'] = le_Name.fit_transform(input1['Name'])
input1['Sex_n'] = le_Name.fit_transform(input1['Sex'])
input1.head()

,Pclass,Name,Sex,Age,Fare,Name_n,Sex_n
0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,108,1
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,190,0
2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,353,0
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,272,0
4,3,"Allen, Mr. William Henry",male,35.0,8.0500,15,1

In [50]:
input2 = input1.drop(['Name','Sex'],axis='columns')
input2.head()

   Pclass   Age     Fare  Name_n  Sex_n
0       3  22.0   7.2500     108      1
1       1  38.0  71.2833     190      0
2       3  26.0   7.9250     353      0
3       1  35.0  53.1000     272      0
4       3  35.0   8.0500      15      1

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test =train_test_split(input2,target,train_size=0.8)

In [66]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [67]:
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [68]:
 model.predict(X_test)

array([0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1,
       1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 0, 1], dtype=int64)

In [69]:
model.score(X_test,y_test)

0.7430167597765364

In [70]:
len(X_train)

712

In [71]:
len(X_test)

179